# Series

In [2]:
import numpy as np

from pandas import Series,DataFrame #si evita di scrivere pd.Series ecc... 
import pandas as pd

In [3]:
#Lets create a Series (array of data and data labels, its index)
obj = Series([3,6,9,12])
obj

0     3
1     6
2     9
3    12
dtype: int64

In [5]:
obj.values

array([ 3,  6,  9, 12], dtype=int64)

In [6]:
obj.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [7]:
#Personalizing index..
ww2_cas = Series([8700000,4300000,3000000,2100000,400000],index=['USSR','Germany','China','Japan','USA'])
ww2_cas

USSR       8700000
Germany    4300000
China      3000000
Japan      2100000
USA         400000
dtype: int64

In [8]:
ww2_cas['USA']

400000

In [9]:
#Can also check with array operations
ww2_cas[ww2_cas>4000000]

USSR       8700000
Germany    4300000
dtype: int64

In [10]:
#Check if the's a value..
'USSR' in ww2_cas

True

In [11]:
#Convert Series in Python dictionary
ww2_dict = ww2_cas.to_dict()
ww2_dict

{'China': 3000000,
 'Germany': 4300000,
 'Japan': 2100000,
 'USA': 400000,
 'USSR': 8700000}

In [12]:
#Or converting them
WW2_Series = Series(ww2_dict)
WW2_Series

China      3000000
Germany    4300000
Japan      2100000
USA         400000
USSR       8700000
dtype: int64

In [13]:
#Passing  dictionary 
countries = ['China','Germany','Japan','USA','USSR','Argentina']
obj2 = Series(ww2_dict,index=countries)

#We can use isnull and notnull to find missing data
pd.isnull(obj2)

China        False
Germany      False
Japan        False
USA          False
USSR         False
Argentina     True
dtype: bool

In [14]:
WW2_Series

China      3000000
Germany    4300000
Japan      2100000
USA         400000
USSR       8700000
dtype: int64

In [15]:
obj2

China        3000000
Germany      4300000
Japan        2100000
USA           400000
USSR         8700000
Argentina        NaN
dtype: float64

In [16]:
# We can mixing two Series and Pandas automatically aligns data
WW2_Series + obj2

Argentina         NaN
China         6000000
Germany       8600000
Japan         4200000
USA            800000
USSR         17400000
dtype: float64

In [18]:
#add a name to a serie or index
obj2.name = 'World War 2 Casualties'
obj2.index.name = 'Countries'
obj2

Countries
China        3000000
Germany      4300000
Japan        2100000
USA           400000
USSR         8700000
Argentina        NaN
Name: World War 2 Casualties, dtype: float64

# Data Frame

In [19]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

#Add some data for Exemple
import webbrowser as wb
website = 'http://en.wikipedia.org/wiki/NFL_win-loss_records'
wb.open(website)

True

In [29]:
#Copy and read to get data..then showing
nfl_frame = pd.read_clipboard() #devo copiare dalla ClipBoard !! retunr Series
nfl_frame

,Rank,Team,Won,Lost,Tied*,Pct.,First Season,Total Games,Conference
0,15,Washington Redskins,592,576,27,0.507,1932,1195,NFC East
1,21,Tennessee Titans,415,448,6,0.481,1960,869,AFC South
2,32,Tampa Bay Buccaneers,241,385,1,0.385,1976,627,NFC South
3,18,St. Louis Rams,552,555,21,0.499,1937,1128,NFC West
4,19,Seattle Seahawks,319,320,0,0.499,1976,639,NFC West
5,6,San Francisco 49ers,545,444,14,0.550,1950,1003,NFC West
6,17,San Diego Chargers,428,425,11,0.502,1960,864,AFC West
7,13,Pittsburgh Steelers,618,561,21,0.524,1933,1200,AFC North
8,20,Philadelphia Eagles,560,594,26,0.486,1933,1180,NFC East
9,11,Oakland Raiders,462,406,11,0.532,1960,879,AFC West
10,26,New York Jets,389,464,8,0.456,1960,861,AFC East
11,8,New York Giants,691,581,33,0.542,1925,1305,NFC East
12,28,New Orleans Saints,331,418,5,0.442,1967,754,NFC South

In [30]:
# We can grab colums
nfl_frame.columns

Index([u'Rank', u'Team', u'Won', u'Lost', u'Tied*', u'Pct.', u'First Season',
       u'Total Games', u'Conference'],
      dtype='object')

In [31]:
#Let's see some data
DataFrame(nfl_frame,columns=['Team','First Season','Total Games'])

                    Team  First Season  Total Games
0    Washington Redskins          1932         1195
1       Tennessee Titans          1960          869
2   Tampa Bay Buccaneers          1976          627
3         St. Louis Rams          1937         1128
4       Seattle Seahawks          1976          639
5    San Francisco 49ers          1950         1003
6     San Diego Chargers          1960          864
7    Pittsburgh Steelers          1933         1200
8    Philadelphia Eagles          1933         1180
9        Oakland Raiders          1960          879
10         New York Jets          1960          861
11       New York Giants          1925         1305
12    New Orleans Saints          1967          754

In [32]:
#if the columsn doesn't exists then is created
DataFrame(nfl_frame,columns=['Team','First Season','Total Games','Stadium'])

                    Team  First Season  Total Games  Stadium
0    Washington Redskins          1932         1195      NaN
1       Tennessee Titans          1960          869      NaN
2   Tampa Bay Buccaneers          1976          627      NaN
3         St. Louis Rams          1937         1128      NaN
4       Seattle Seahawks          1976          639      NaN
5    San Francisco 49ers          1950         1003      NaN
6     San Diego Chargers          1960          864      NaN
7    Pittsburgh Steelers          1933         1200      NaN
8    Philadelphia Eagles          1933         1180      NaN
9        Oakland Raiders          1960          879      NaN
10         New York Jets          1960          861      NaN
11       New York Giants          1925         1305      NaN
12    New Orleans Saints          1967          754      NaN

In [33]:
nfl_frame.Team
nfl_frame['Team']

0      Washington Redskins
1         Tennessee Titans
2     Tampa Bay Buccaneers
3           St. Louis Rams
4         Seattle Seahawks
5      San Francisco 49ers
6       San Diego Chargers
7      Pittsburgh Steelers
8      Philadelphia Eagles
9          Oakland Raiders
10           New York Jets
11         New York Giants
12      New Orleans Saints
Name: Team, dtype: object

In [37]:
# Or we can retrive rows using ix[]
nfl_frame.ix[2] # Seleziona la riga 3 (parte da 0)

Rank                              32
Team            Tampa Bay Buccaneers
Won                              241
Lost                             385
Tied*                              1
Pct.                           0.385
First Season                    1976
Total Games                      627
Conference                 NFC South
Name: 2, dtype: object

In [38]:
# We can assign value to ENTIRE columsn
nfl_frame['Stadium']="Levi's Stadium"
nfl_frame

,Rank,Team,Won,Lost,Tied*,Pct.,First Season,Total Games,Conference,Stadium
0,15,Washington Redskins,592,576,27,0.507,1932,1195,NFC East,Levi's Stadium
1,21,Tennessee Titans,415,448,6,0.481,1960,869,AFC South,Levi's Stadium
2,32,Tampa Bay Buccaneers,241,385,1,0.385,1976,627,NFC South,Levi's Stadium
3,18,St. Louis Rams,552,555,21,0.499,1937,1128,NFC West,Levi's Stadium
4,19,Seattle Seahawks,319,320,0,0.499,1976,639,NFC West,Levi's Stadium
5,6,San Francisco 49ers,545,444,14,0.550,1950,1003,NFC West,Levi's Stadium
6,17,San Diego Chargers,428,425,11,0.502,1960,864,AFC West,Levi's Stadium
7,13,Pittsburgh Steelers,618,561,21,0.524,1933,1200,AFC North,Levi's Stadium
8,20,Philadelphia Eagles,560,594,26,0.486,1933,1180,NFC East,Levi's Stadium
9,11,Oakland Raiders,462,406,11,0.532,1960,879,AFC West,Levi's Stadium
10,26,New York Jets,389,464,8,0.456,1960,861,AFC East,Levi's Stadium
11,8,New York Giants,691,581,33,0.542,1925,1305,NFC East,Levi's Stadium
12,28,New Orleans Saints,331,418,5,0.442,1967,754,NFC South,Levi's Stadium

In [40]:
# Or assign value to ENTIRE columsn
nfl_frame['Stadium'] = np.arange(13)
nfl_frame

,Rank,Team,Won,Lost,Tied*,Pct.,First Season,Total Games,Conference,Stadium
0,15,Washington Redskins,592,576,27,0.507,1932,1195,NFC East,0
1,21,Tennessee Titans,415,448,6,0.481,1960,869,AFC South,1
2,32,Tampa Bay Buccaneers,241,385,1,0.385,1976,627,NFC South,2
3,18,St. Louis Rams,552,555,21,0.499,1937,1128,NFC West,3
4,19,Seattle Seahawks,319,320,0,0.499,1976,639,NFC West,4
5,6,San Francisco 49ers,545,444,14,0.550,1950,1003,NFC West,5
6,17,San Diego Chargers,428,425,11,0.502,1960,864,AFC West,6
7,13,Pittsburgh Steelers,618,561,21,0.524,1933,1200,AFC North,7
8,20,Philadelphia Eagles,560,594,26,0.486,1933,1180,NFC East,8
9,11,Oakland Raiders,462,406,11,0.532,1960,879,AFC West,9
10,26,New York Jets,389,464,8,0.456,1960,861,AFC East,10
11,8,New York Giants,691,581,33,0.542,1925,1305,NFC East,11
12,28,New Orleans Saints,331,418,5,0.442,1967,754,NFC South,12

In [41]:
#DataFrames can be constructed many ways. EX from dictionaries
data = {'City':['SF','LA','NYC'],
        'Population': [876000,367000,666000]}
city_frame = DataFrame(data)
city_frame

  City  Population
0   SF      876000
1   LA      367000
2  NYC      666000

In [ ]:
#For full list of ways to create DataFrames from various sources go to teh documentation for pandas:
website = 'http://pandas.pydata.org/pandas-docs/dev/generated/pandas.DataFrame.html'
webbrowser.open(website)

# Index Objects

In [43]:
import numpy as np
from numpy.random import randn
import pandas as pd
from pandas import Series,DataFrame

In [45]:
#Index are immutable!
ser1 = Series([1,2,3,4],index=['A','B','C','D'])
ser2 = ser1.reindex(['A','B','C','D','E','F']) # Reindexing, new index are filled as NaN
ser2

A     1
B     2
C     3
D     4
E   NaN
F   NaN
dtype: float64

In [47]:
ser2.reindex(['A','B','C','D','E','F','G'],fill_value=0) # to fill as 0

A     1
B     2
C     3
D     4
E   NaN
F   NaN
G     0
dtype: float64

In [48]:
#Other filling method
ser3 = Series(['USA','Mexico','Canada'],index=[0,5,10])
ser3.reindex(range(15),method='ffill')

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [49]:
#Lets make a datafram ewith some random values
dframe = DataFrame(randn(25).reshape((5,5)),index=['A','B','D','E','F'],columns=['col1','col2','col3','col4','col5'])
dframe

       col1      col2      col3      col4      col5
A -0.463715 -0.761641  0.077590  1.513920  1.573465
B -1.912022 -1.271006  1.408115 -0.585511  0.340535
D  1.215401  0.671718  0.027166  1.872128 -0.466021
E  1.068706 -0.467902 -0.130887 -0.394162  0.447285
F -1.884641 -0.747262  1.322214 -0.259611 -0.782050

In [50]:
#Posso aggiungere colonne o righe..
dframe2 = dframe.reindex(['A','B','C','D','E','F']) 
new_columns = ['col1','col2','col3','col4','col5','col6']
dframe2.reindex(columns=new_columns)

       col1      col2      col3      col4      col5  col6
A -0.463715 -0.761641  0.077590  1.513920  1.573465   NaN
B -1.912022 -1.271006  1.408115 -0.585511  0.340535   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D  1.215401  0.671718  0.027166  1.872128 -0.466021   NaN
E  1.068706 -0.467902 -0.130887 -0.394162  0.447285   NaN
F -1.884641 -0.747262  1.322214 -0.259611 -0.782050   NaN

In [51]:
# Or more quikly..
dframe.ix[['A','B','C','D','E','F'],new_columns]

       col1      col2      col3      col4      col5  col6
A -0.463715 -0.761641  0.077590  1.513920  1.573465   NaN
B -1.912022 -1.271006  1.408115 -0.585511  0.340535   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D  1.215401  0.671718  0.027166  1.872128 -0.466021   NaN
E  1.068706 -0.467902 -0.130887 -0.394162  0.447285   NaN
F -1.884641 -0.747262  1.322214 -0.259611 -0.782050   NaN

# Drop Entry

In [53]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [54]:
# Drop with series
ser1 = Series(np.arange(3),index=['a','b','c'])
ser1.drop('b')

a    0
c    2
dtype: int32

In [56]:
# Drop with dframe
dframe1 = DataFrame(np.arange(9).reshape((3,3)),index=['SF','LA','NY'],columns=['pop','size','year'])
dframe1.drop('LA')
dframe1.drop('year',axis=1) #when drop a columns u need to specify axis

    pop  size
SF    0     1
LA    3     4
NY    6     7

# Selecting Entries

In [57]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

In [58]:
# Lets try some Series indexing
ser1 = Series(np.arange(3),index=['A','B','C'])
ser1 = 2*ser1
ser1

A    0
B    2
C    4
dtype: int32

In [59]:
#Grab entry by..
ser1['B']
ser1[1]
ser1[0:3]
ser1[['A','C']]
ser1[ser1>3]

C    4
dtype: int32

In [ ]:
# Lets try some DataFrame indexing

In [60]:
dframe = DataFrame(np.arange(25).reshape((5,5)),index=['NYC','LA','SF','DC','Chi'],columns=['A','B','C','D','E'])
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [66]:
#Grab entry by..
dframe[['B','E']]
dframe[dframe['C']>8] # Using logic
dframe.ix['LA'] # Or ix[]
dframe.ix[1]

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int32

# Data Alignment

In [67]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

In [69]:
ser1 = Series([0,1,2],index=['A','B','C'])
ser2 = Series([3,4,5,6],index=['A','B','C','D'])
ser1 + ser2 # Automatically adds NaN values

A     3
B     5
C     7
D   NaN
dtype: float64

In [70]:
# Now let's try it with DataFrames!
dframe1 = DataFrame(np.arange(4).reshape(2,2),columns=list('AB'),index=['NYC','LA'])
dframe2 = DataFrame(np.arange(9).reshape(3,3),columns=list('ADC'),index=['NYC','SF','LA'])
dframe1 + dframe2 # deve trovare un valore sia in riga che colonna

      A   B   C   D
LA    8 NaN NaN NaN
NYC   0 NaN NaN NaN
SF  NaN NaN NaN NaN

In [71]:
dframe1.add(dframe2,fill_value=0)

     A   B  C  D
LA   8   3  8  7
NYC  0   1  2  1
SF   3 NaN  5  4